blog/2015-01-03-using-a-chromebook-as-a-development-machine.html

<!DOCTYPE html>
<!--[if IEMobile 7 ]><html class="no-js iem7"><![endif]-->
<!--[if lt IE 9]><html class="no-js lte-ie8"><![endif]-->
<!--[if (gt IE 8)|(gt IEMobile 7)|!(IEMobile)|!(IE)]><!--><html class="no-js" lang="en"><!--<![endif]-->
<head>
  <meta charset="utf-8">
  <title>Using a Chromebook as a Development Machine - GordyBlog</title>
  <meta name="author" content="Gordon Tillman">

  
  <meta name="description" content="Introduction I have been interested in seeing if would be possible to set-up a
Chromebook so that some serious development work with it. It's a &hellip;">
  

  <!-- http://t.co/dKP3o1e -->
  <meta name="HandheldFriendly" content="True">
  <meta name="MobileOptimized" content="320">
  <meta name="viewport" content="width=device-width, initial-scale=1">

  
  <link rel="canonical" href="http://blog.gordontillman.info/blog/2015-01-03-using-a-chromebook-as-a-development-machine.html">
  <link href="/favicon.png" rel="icon">
  <link href="/stylesheets/screen.css" media="screen, projection" rel="stylesheet" type="text/css">
  <link href="/atom.xml" rel="alternate" title="GordyBlog" type="application/atom+xml">
  <!--Fonts from Google"s Web font directory at http://google.com/webfonts -->
<link href="//fonts.googleapis.com/css?family=PT+Serif:regular,italic,bold,bolditalic" rel="stylesheet" type="text/css">
<link href="//fonts.googleapis.com/css?family=PT+Sans:regular,italic,bold,bolditalic" rel="stylesheet" type="text/css">

  


</head>

<body   >
  <header role="banner"><hgroup>
  <h1><a href="/">GordyBlog</a></h1>
  
    <h2>Yet another blogging experiment&#8230;</h2>
  
</hgroup>

</header>
  <nav role="navigation"><ul class="subscription" data-subscription="rss">
  <li><a href="/atom.xml" rel="subscribe-rss" title="subscribe via RSS">RSS</a></li>
  
</ul>
  
<form action="https://www.google.com/search" method="get">
  <fieldset role="search">
    <input type="hidden" name="q" value="site:blog.gordontillman.info" />
    <input class="search" type="text" name="q" results="0" placeholder="Search"/>
  </fieldset>
</form>
  
<ul class="main-navigation">
  <li><a href="/">Blog</a></li>
  <li><a href="/blog/archives">Archives</a></li>
</ul>

</nav>
  <div id="main">
    <div id="content">
      <div>
<article class="hentry" role="article">
  
  <header>
    
      <h1 class="entry-title">Using a Chromebook as a Development Machine</h1>
    
    
      <p class="meta">
        




<time class='entry-date' datetime='2015-01-03'><span class='date'>2015-01-03 (Saturday)</span> <span class='time'>12:00 am</span></time>
        
      </p>
    
  </header>


<div class="entry-content"><div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
I have been interested in seeing if would be possible to set-up a
<a href="https://www.google.com/chrome/devices/">Chromebook</a> so that some serious development work with it.  It&#8217;s a
given that you won&#8217;t be running any virtual machines on a Chromebook.
But at this point I think you can do pretty much any thing else you
might need to do.
</p>

<p>
<!-- more -->
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">A Minimal Chromebook</h2>
<div class="outline-text-2" id="text-2">
<p>
First of all, let me say that I think that you need, at a minimum, a
Chromebook that has 4GB of RAM and 32GB of local storage.  I decided
on the <a href="http://smile.amazon.com/gp/product/B00KGI4XBI">ASUS model C200MA-EDU-4GB</a>.  This machine is very inexpensive,
has a decent display and keyboard, and meets my minimum RAM/storage
requirements.
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Options</h2>
<div class="outline-text-2" id="text-3">
<p>
As I see it, there are at least two options you can choose that will
let you use a Chromebook as a serious development machine.  I have
tried both of these and am now using a combination of the two.
</p>

<p>
The first option is to use a basically stock Chromebook in conjunction
with an inexpensive Virtual Private Server (VPS).  For this to be a
viable option you must be doing your work someplace where you have a
decent Internet connection.  
</p>

<p>
You rent a VPS, install a nice Linux. I like Ubuntu 14.04 LTS (Trusty
Tahr).  You install all of your tools there and use the Chromebook as
a portable terminal that lets you access these tools.
</p>

<p>
But what if you want the option of doing useful work from anywhere,
whether or not you have a good Internet connection? In that case, we
take a look at the second option.
</p>

<p>
The second option is to enable developer mode on your Chromebook,
install Linux in a chroot environment along with whatever tools you
need, and work in ChromeOS or your chroot environment as needed.
</p>

<p>
This turns out to be extremely easy to accomplish.  The remainder of
this post will cover the steps I followed to get this going.
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Enabling dev mode</h2>
<div class="outline-text-2" id="text-4">
<p>
The exact procedure required to enable dev mode will vary from one
Chromebook to another.  For an Asus C200 it is extremely simple.
</p>

<ol class="org-ol">
<li>Tap the power button while pressing and holding the <i>esc</i> and
<i>refresh</i> buttons.  Note that the <i>refresh</i> button is on the top
row of keys and looks like a circular arrow.
</li>
<li>The Chromebook will reboot and you will see a screen that tells you
that Chrome OS is missing or damaged.  Just hit <code>ctrl-d</code> and then
<i>enter</i> to continue.
</li>
<li>The computer will restart and you will see a screen that tells you
OS verification is off.  Hit <code>ctrl-d</code> to continue.
</li>
<li>Go take a break while your Chromebook&#8217;s data is reset.  I didn&#8217;t
pay attention to how long it took, but you will get a textual
progress bar at the top of the window while this is in progress.
</li>
<li>When it finally comes back up just connect to your wireless network
and log-in as normal.
</li>
</ol>

<p>
<b>Note:</b> From this point on you will always see the verification screen
when you restart.  No worries, just hit <code>ctrl-d</code> to proceed.
</p>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Installing the Crouton Integration Chrome extension</h2>
<div class="outline-text-2" id="text-5">
<p>
This is pretty cool.  It lets you run your Linux windowing manager in
a Chrome frame that shows up on your dock at the bottom of the
screen.  Let&#8217;s go ahead and install it now so that it will be in place
when your Ubuntu installation has finished.
</p>

<ul class="org-ul">
<li>From Chrome, navigate <a href="https://chrome.google.com/webstore/detail/crouton-integration/gcpneefbbnfalgjniomfjknbcgkbijom">to this URL</a> and install the extension.  That&#8217;s
it!
</li>
</ul>
</div>
</div>
