source/hugo-site/content/posts/2015-01-03-using-a-chromebook-as-a-development-machine.md
+++
title = "Using a Chromebook as a Development Machine"
author = ["Gordon Tillman"]
date = 2015-01-03
tags = ["chromebook", "linux", "ubuntu"]
draft = false
+++

## Introduction {#introduction}

I have been interested in seeing if would be possible to set-up a
[Chromebook](https://www.google.com/chrome/devices/) so that some serious development work with it.  It's a
given that you won't be running any virtual machines on a Chromebook.
But at this point I think you can do pretty much any thing else you
might need to do.

<!--more-->


## A Minimal Chromebook {#a-minimal-chromebook}

First of all, let me say that I think that you need, at a minimum, a
Chromebook that has 4GB of RAM and 32GB of local storage.  I decided
on the [ASUS model C200MA-EDU-4GB](http://smile.amazon.com/gp/product/B00KGI4XBI).  This machine is very inexpensive,
has a decent display and keyboard, and meets my minimum RAM/storage
requirements.


## Options {#options}

As I see it, there are at least two options you can choose that will
let you use a Chromebook as a serious development machine.  I have
tried both of these and am now using a combination of the two.

The first option is to use a basically stock Chromebook in conjunction
with an inexpensive Virtual Private Server (VPS).  For this to be a
viable option you must be doing your work someplace where you have a
decent Internet connection.

You rent a VPS, install a nice Linux. I like Ubuntu 14.04 LTS (Trusty
Tahr).  You install all of your tools there and use the Chromebook as
a portable terminal that lets you access these tools.

But what if you want the option of doing useful work from anywhere,
whether or not you have a good Internet connection? In that case, we
take a look at the second option.

The second option is to enable developer mode on your Chromebook,
install Linux in a chroot environment along with whatever tools you
need, and work in ChromeOS or your chroot environment as needed.

This turns out to be extremely easy to accomplish.  The remainder of
this post will cover the steps I followed to get this going.


## Enabling dev mode {#enabling-dev-mode}

The exact procedure required to enable dev mode will vary from one
Chromebook to another.  For an ASUS C200 it is extremely simple.

1.  Tap the power button while pressing and holding the _esc_ and
    _refresh_ buttons.  Note that the _refresh_ button is on the top
    row of keys and looks like a circular arrow.
2.  The Chromebook will reboot and you will see a screen that tells you
    that Chrome OS is missing or damaged.  Just hit `ctrl-d` and then
    _enter_ to continue.
3.  The computer will restart and you will see a screen that tells you
    OS verification is off.  Hit `ctrl-d` to continue.
4.  Go take a break while your Chromebook's data is reset.  I didn't
    pay attention to how long it took, but you will get a textual
    progress bar at the top of the window while this is in progress.
5.  When it finally comes back up just connect to your wireless network
    and log-in as normal.

**Note:** From this point on you will always see the verification screen
when you restart.  No worries, just hit `ctrl-d` to proceed.


## Installing the Crouton Integration Chrome extension {#installing-the-crouton-integration-chrome-extension}

This is pretty cool.  It lets you run your Linux windowing manager in
a Chrome frame that shows up on your dock at the bottom of the
screen.  Let's go ahead and install it now so that it will be in place
when your Ubuntu installation has finished.

-   From Chrome, navigate [to this URL](https://chrome.google.com/webstore/detail/crouton-integration/gcpneefbbnfalgjniomfjknbcgkbijom) and install the extension.  That's
    it!
