source/blog/2015-01-03-using-a-chromebook-as-a-development-machine.org
** Installing Ubuntu via Crouton

Crouton stands for /Chromium OS Universal Chroot Environment/.  It is
a very nice shell script that greatly simplifies the process of
installing and running your Linux environment on the Chromebook.

- [[https://goo.gl/fd3zc][Click here]] from Chrome to download the latest version of the script.
- Pull up a terminal window as follows:
  - Hit ~ctrl+alt+t~
  - Type ~shell~ and hit /enter/.
  - Type ~cd ~/Downloads~ and hit /enter/.
  - If you then enter ~ls~ you should see the Crouton script you just
    downloaded.

The instructions that follow assume that you want to install Ubuntu
14.04 LTS using the ~xfce~ window manager.

- Type ~sudo sh -e ./crouton -r trusty -t xfce,xiwi~ and hit /enter/.
- After everything is installed you will be asked to enter a username
  and password.

** Running Ubuntu

Here is the basic procedure for entering your chroot environment and
starting your Ubuntu environment.

- If necessary, get a terminal session going.  Remember the steps to
  do this?
  - Hit ~ctrl+alt+t~
  - Type ~shell~ and hit /enter/.
- Enter the chroot environment by typing ~sudo enter-chroot~ and
  hitting /enter/.
- Start up the Ubuntu UI by typing ~startxfce4~ and hitting /enter/.
- As a shortcut you can do the following:
  - Pull up a terminal session
  - Types ~sudo startxfce4~ and hit /enter/.


By default this will start up the Ubuntu windowing system in full
screen mode.  To toggle full-screen mode just hit what would be the F4
button on the top row of the keyboard.  On my ASUS this button looks
like a rectangle with little arrow-heads in the top-left and
bottom-right corners.  Google calls this /immersive mode/.

** Enable Verified Boot and Auto Updates

This tip came from [[https://sites.google.com/site/chromeoswikisite/home/what-s-new-in-dev-and-beta/shell-acess-with-verified-boot][here]].  Enabling developer mode will disable
verified boot by default.  To fix it, just do the following:

- Open a shell and become root
  #+BEGIN_SRC sh
    Control-Alt-T
    shell
    sudo su -
  #+END_SRC
- If you have not already done so, set a password for the /root/ user
  by entering the following command and following the prompts:
  #+BEGIN_SRC sh
  chromeos-setdevpasswd
  #+END_SRC
- Enable verified boot from the root shell:
  #+BEGIN_SRC sh
  crossystem dev_boot_usb=0 dev_boot_signed_only=1
  #+END_SRC

Please see the [[https://sites.google.com/site/chromeoswikisite/home/what-s-new-in-dev-and-beta/shell-acess-with-verified-boot][original post]] for more information and some screen shots.


