blog/2015-01-03-using-a-chromebook-as-a-development-machine.html

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">Installing Ubuntu via Crouton</h2>
<div class="outline-text-2" id="text-6">
<p>
Crouton stands for <i>Chromium OS Universal Chroot Environment</i>.  It is
a very nice shell script that greatly simplifies the process of
installing and running your Linux environment on the Chromebook.
</p>

<ul class="org-ul">
<li><a href="https://goo.gl/fd3zc">Click here</a> from Chrome to download the latest version of the script.
</li>
<li>Pull up a terminal window as follows:
<ul class="org-ul">
<li>Hit <code>ctrl+alt+t</code>
</li>
<li>Type <code>shell</code> and hit <i>enter</i>.
</li>
<li>Type <code>cd ~/Downloads</code> and hit <i>enter</i>.
</li>
<li>If you then enter <code>ls</code> you should see the Crouton script you just
downloaded.
</li>
</ul>
</li>
</ul>

<p>
The instructions that follow assume that you want to install Ubuntu
14.04 LTS using the <code>xfce</code> window manager.
</p>

<ul class="org-ul">
<li>Type <code>sudo sh -e ./crouton -r trusty -t xfce,xiwi</code> and hit <i>enter</i>.
</li>
<li>After everything is installed you will be asked to enter a username
and password.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">Running Ubuntu</h2>
<div class="outline-text-2" id="text-7">
<p>
Here is the basic procedure for entering your chroot environment and
starting your Ubuntu environment.
</p>

<ul class="org-ul">
<li>If necessary, get a terminal session going.  Remember the steps to
do this?
<ul class="org-ul">
<li>Hit <code>ctrl+alt+t</code>
</li>
<li>Type <code>shell</code> and hit <i>enter</i>.
</li>
</ul>
</li>
<li>Enter the chroot environment by typing <code>sudo enter-chroot</code> and
hitting <i>enter</i>.
</li>
<li>Start up the Ubuntu UI by typing <code>startxfce4</code> and hitting <i>enter</i>.
</li>
<li>As a shortcut you can do the following:
<ul class="org-ul">
<li>Pull up a terminal session
</li>
<li>Types <code>sudo startxfce4</code> and hit <i>enter</i>.
</li>
</ul>
</li>
</ul>


<p>
By default this will start up the Ubuntu windowing system in full
screen mode.  To toggle fullscreen mode just hit what would be the F4
button on the top row of the keyboard.  On my Asus this button looks
like a rectangle with little arrow-heads in the top-left and
bottom-right corners.  Google calls this <i>immersive mode</i>.
</p>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8">Enable Verified Boot and Auto Updates</h2>
<div class="outline-text-2" id="text-8">
<p>
This tip came from <a href="https://sites.google.com/site/chromeoswikisite/home/what-s-new-in-dev-and-beta/shell-acess-with-verified-boot">here</a>.  Enabling developer mode will disable
verified boot by default.  To fix it, just do the following:
</p>

<ul class="org-ul">
<li>Open a shell and become root
<div class="org-src-container">

<pre class="src src-sh">Control-Alt-T
shell
sudo su -
</pre>
</div>
</li>
<li>If you have not already done so, set a password for the <i>root</i> user
by entering the following command and following the prompts:
<div class="org-src-container">

<pre class="src src-sh">chromeos-setdevpasswd
</pre>
</div>
</li>
<li>Enable verified boot from the root shell:
<div class="org-src-container">

<pre class="src src-sh">crossystem <span style="color: #e7c547;">dev_boot_usb</span>=0 <span style="color: #e7c547;">dev_boot_signed_only</span>=1
</pre>
</div>
</li>
</ul>

<p>
Please see the <a href="https://sites.google.com/site/chromeoswikisite/home/what-s-new-in-dev-and-beta/shell-acess-with-verified-boot">original post</a> for more information and some screen shots.
</p>
</div>
</div>
