source/blog/2015-01-03-using-a-chromebook-as-a-development-machine.org
** References

These are some of the sites I read through when setting up the
Chromebook:

- [[https://sites.google.com/site/chromeoswikisite/home/what-s-new-in-dev-and-beta/shell-acess-with-verified-boot][Shell Access With Verified Boot And Auto Updates]]
- [[http://liliputing.com/2014/06/asus-c200-chromebook-enabling-dev-mode-installing-ubuntu.html][Asus C200 Chromebook: Enabling dev mode, installing Ubuntu]]
- [[http://www.howtogeek.com/162120/how-to-install-ubuntu-linux-on-your-chromebook-with-crouton/][How to Install Ubuntu Linux on Your Chromebook with Crouton]]
- [[https://github.com/dnschneid/crouton][David Schneider's Crouton GitHub Page]]
- [[https://github.com/dnschneid/crouton/wiki/Security][David Schneider on Security]]
- [[https://sites.google.com/site/chromeoswikisite/home][The Chrome OS Wiki]]
- [[http://tomwwolf.com/chromebook-14-compedium/chromebook-crouton-cookbook/][Tom Wolf's Crouton Cookboook]]
- [[https://plus.google.com/u/0/%2BFrancoisBeaufort/posts/JDVkXALPcNq][François Beaufort's Google+ Profile Page]]
- [[http://fuyuko.net/basic-tweaks-and-tips-for-crouton-in-chromebook/][Fuyuko Gratton's Basic Tweaks and Tips for Crouton in Chromebook]]
- [[http://www.postslush.com/2014/12/crouton-ubuntu-running-in-browser-tab.html][Crouton Ubuntu running in a browser tab of a Chromebook]]
- [[https://support.google.com/chromebook/answer/183093?hl%3Den][Google's Supported file types and external devices]]
- [[https://support.google.com/chromebook/answer/1047364?hl%3Den][Google's Chromebook Keyboard Features]]
- [[http://vpsdime.com/][vpsdime]] - Where my VPS lives


