source/hugo-site/content/posts/2015-01-03-using-a-chromebook-as-a-development-machine.md


## References {#references}

These are some of the sites I read through when setting up the
Chromebook:

-   [Shell Access With Verified Boot And Auto Updates](https://sites.google.com/site/chromeoswikisite/home/what-s-new-in-dev-and-beta/shell-acess-with-verified-boot)
-   [Asus C200 Chromebook: Enabling dev mode, installing Ubuntu](http://liliputing.com/2014/06/asus-c200-chromebook-enabling-dev-mode-installing-ubuntu.html)
-   [How to Install Ubuntu Linux on Your Chromebook with Crouton](http://www.howtogeek.com/162120/how-to-install-ubuntu-linux-on-your-chromebook-with-crouton/)
-   [David Schneider's Crouton GitHub Page](https://github.com/dnschneid/crouton)
-   [David Schneider on Security](https://github.com/dnschneid/crouton/wiki/Security)
-   [The Chrome OS Wiki](https://sites.google.com/site/chromeoswikisite/home)
-   [Tom Wolf's Crouton Cookboook](http://tomwwolf.com/chromebook-14-compedium/chromebook-crouton-cookbook/)
-   [François Beaufort's Google+ Profile Page](https://plus.google.com/u/0/%2BFrancoisBeaufort/posts/JDVkXALPcNq)
-   [Fuyuko Gratton's Basic Tweaks and Tips for Crouton in Chromebook](http://fuyuko.net/basic-tweaks-and-tips-for-crouton-in-chromebook/)
-   [Crouton Ubuntu running in a browser tab of a Chromebook](http://www.postslush.com/2014/12/crouton-ubuntu-running-in-browser-tab.html)
-   [Google's Supported file types and external devices](https://support.google.com/chromebook/answer/183093?hl%3Den)
-   [Google's Chromebook Keyboard Features](https://support.google.com/chromebook/answer/1047364?hl%3Den)
-   [vpsdime](http://vpsdime.com/) - Where my VPS lives
